InformationRegisters/СЛ_Контроль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СЛ_Контроль</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СЛ_НастройкиМониторинга</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СЛ_Уровни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СЛ_ХранилищеНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СЛ_ХранилищеНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СЛ_НастройкиМониторинга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/СЛ_ЛогированиеСервер/Ext/Module.bsl
// Фиксирует событие мониторинга в асинхронном режиме при включенном контроле лимитов
//
// Параметры:
//   Событие - Строка - наименование события
//   Уровень - Число - уровень события (уровень логирования)
//   Объект - <Произвольный> - объект, с которым связано событие
//   ДопДанные - Структура, <Произвольный> - дополнительные данные о событии
Процедура Зафиксировать(Событие, Уровень, Объект = Неопределено, ДопДанные = Неопределено) Экспорт
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия = Новый Структура;
    ПараметрыСобытия.Вставить("Период",      ТекущаяДатаСеанса());
    ТекущийЮзер = Справочники.Пользователи.ПустаяСсылка();
	Попытка
    ТекущийЮзер = ПараметрыСеанса.ТекущийПользователь;
	Исключение
	КонецПопытки;
	ПараметрыСобытия.Вставить("Пользователь", ТекущийЮзер);
    ПараметрыСобытия.Вставить("Событие",     Событие);
	ПараметрыСобытия.Вставить("Уровень", Уровень);
    ПараметрыСобытия.Вставить("Объект",      Объект);
    ПараметрыСобытия.Вставить("ИмяКомпьютера", ИмяКомпьютера());
    ПараметрыСобытия.Вставить("НомерСеанса",   НомерСеансаИнформационнойБазы()); 
    
     Если ТипЗнч(ДопДанные) = Тип("Структура") Тогда
        ОписаниеТекст = "";
        Для каждого КлючИЗначение Из ДопДанные Цикл
            ОписаниеТекст = ОписаниеТекст + КлючИЗначение.Ключ + ": " + КлючИЗначение.Значение + "; ";
        КонецЦикла;
        ПараметрыСобытия.Вставить("Описание", ОписаниеТекст);   
        ПараметрыСобытия.Вставить("Данные", Новый ХранилищеЗначения(ДопДанные));
    Иначе
        ПараметрыСобытия.Вставить("Описание", Строка(ДопДанные));
   КонецЕсли;
   МассивПараметров = Новый Массив;
    МассивПараметров.Добавить(ПараметрыСобытия);
    ФоновыеЗадания.Выполнить("СЛ_ЛогированиеСервер.ЗаписатьВРегистрФон", МассивПараметров);
КонецПроцедуры    

// Записывает данные в регистр сведений СЛ_Контроль на основе переданных параметров.
//
// Параметры:
//   Параметры - Структура - свойства для заполнения записи регистра, возможно дополнительное свойство Данные
Процедура ЗаписатьВРегистрФон(Параметры) Экспорт
   МенеджерЗаписи = РегистрыСведений.СЛ_Контроль.СоздатьМенеджерЗаписи();
   ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Параметры);
   Если Параметры.Свойство("Данные") Тогда
        МенеджерЗаписи.Данные = Параметры.Данные;
    КонецЕсли;
    Попытка
        МенеджерЗаписи.Записать();
    Исключение
        ЗаписьЖурналаРегистрации("СЛ.ЗаписьФон", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
    КонецПопытки;
    
КонецПроцедуры

// Возвращает признак включения мониторинга для указанного вида события.
//
// Параметры:
//   ВидСобытия - Строка - идентификатор вида события
//
// Возвращаемое значение:
//   Булево - Истина, если мониторинг включен, иначе Ложь
Функция МониторингВключен(ВидСобытия) Экспорт
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ

    |	Регистр.Значение КАК Значение
    |ИЗ
    |	РегистрСведений.СЛ_ХранилищеНастроек КАК Регистр

    |ГДЕ
    |	Регистр.Настройка = &Настройка";
    
    Запрос.УстановитьПараметр("Настройка", ВидСобытия);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Значение;
    КонецЕсли;
    
    Возврат Ложь;
КонецФункции
